<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5687730b687c33f6ce5e64f467a959984e9eb42b2463b745fef0c8a982458ca3","plan_job_ref":"Job terraform plan #124 at https://github.com/suzutan/infra/actions/runs/16689373025","plan_out_hash":"78d9cc92afb06fb589bff4b7d33084ef6fe244070b7b93ecc09ac33e99f5cc74","plan_hash":"0856d27a0415fbdbebe334758e27ebd67fd629daf8438dc1eea99636e5dc7a27","plan_text_format":"diff","version":"2.2.0"} -->
Terraform plan in __terraform/suzutan.jp__
<details>
<summary>Plan: 5 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.atria will be created
+   resource "cloudflare_dns_record" "atria" {
+       comment_modified_on = (known after apply)
+       content             = "edge.osk.nw.suzutan.jp"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "atria"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.bluesky_site_verification will be updated in-place
!~  resource "cloudflare_dns_record" "bluesky_site_verification" {
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
        id                  = "e895419ec0a8ee15e34fbc09adf0e58f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "_atproto.suzutan.jp" -> "_atproto"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
!~      tags                = [] -> (known after apply)
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.osk_nw will be created
+   resource "cloudflare_dns_record" "osk_nw" {
+       comment_modified_on = (known after apply)
+       content             = "172.20.1.1"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "osk.nw"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "A"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.rt_osk_nw will be created
+   resource "cloudflare_dns_record" "rt_osk_nw" {
+       comment_modified_on = (known after apply)
+       content             = "172.20.1.1"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "rt.osk.nw"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "A"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.silverstone_osk_nw will be created
+   resource "cloudflare_dns_record" "silverstone_osk_nw" {
+       comment_modified_on = (known after apply)
+       content             = "172.20.1.2"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "silverstone.osk.nw"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "A"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.spica will be created
+   resource "cloudflare_dns_record" "spica" {
+       comment_modified_on = (known after apply)
+       content             = "edge.osk.nw.suzutan.jp"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "spica"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Resource not found

  with cloudflare_dns_record.osk_nw,
  on lan_osk.tf line 6, in resource "cloudflare_dns_record" "osk_nw":
   6: resource "cloudflare_dns_record" "osk_nw" {

The resource was not found on the server and will be removed from state.

(and 4 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [terraform plan #124](https://github.com/suzutan/infra/actions/runs/16689373025)